#1.3.1
n1=2              #整型
n2=1.3            #浮点
n3=float(2)       #转换为浮点类型
t=True            #布尔真
f=False           #布尔假
n4=t==1
n5=f==0

#1.3.2
s1='1234'
s2='''hello word!'''
s3='I Like python'

#1.3.3
L1=[1,2,3,4,5,6]      
L2=[1,2,'HE',3,5]
L3=['KJ','CK','HELLO']

#1.3.4
t1=(1,2,3,4,6)     
t2=(1,2,'kl')
t3=('h1','h2','h3')

#1.3.5
J1={1,'h',2,3,9}   
J2={1,'h',2,3,9,2}   
J3={'KR','LY','SE'}
J4={'KR','LY','SE','SE'}
print(J1)
print(J2)
print(J3)
print(J4)

#1.3.6
d1={1:'h',2:[1,2,'k'],3:9}
d2={'a':2,'b':'ky'}
d3={'q1':[90,100],'k2':'kkk'}

